t-cool/stackchan-idf/sdkconfig.defaults.esp32s3
# M5Stack CoreS3 (ESP32-S3) specific defaults.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# CoreS3 has 8 MB quad-SPI PSRAM. The avatar canvas (320*240*2 = 150 KB) lives there.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# NOTE: SPIRAM_MALLOC_ALWAYSINTERNAL is intentionally NOT set here. The
# value lives in the common sdkconfig.defaults (=1024) — this per-target
# file is loaded *after* it in the SDKCONFIG_DEFAULTS chain, so setting it
# here would silently override the common value. A stale 16384 here was
# exactly that bug: local builds (whose persisted sdkconfig had 1024)
# worked, but fresh CI builds got 16384 and the esp-aes DMA alloc failed
# during TLS reconnects. Keep memory tuning in the common file only.

# Default console on the on-board USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
